[
  {
    "company": "Whop",
    "role": "Software engineer",
    "tenure": "12/2021 - 12/2022",
    "accomplishments": [
      "Developed an e-commerce platform for content creators using TypeScript, React.js, Next.js, and GraphQL, enabling the sale of diverse digital products with a seamless user experience as part of a 7-person team.",
      "Collaborated with the design team to evaluate and enhance landing pages, implementing data-driven changes that led to a 30% increase in conversion rates and improved user experience over a 2-month period.",
      "Leveraged RESTful API routes and GraphQL Queries, provided by the backend team, for efficient data manipulation and retrieval on the frontend.",
      "Designed & developed a rich text editor with features such as text formatting and media embedding, enabling better content control and driving a 10% increase in new businesses on the platform over three months.",
      "Applied Agile methodologies in product development, contributing to the creation of innovative features such 2FA and one-click checkout that were adopted by over 500,000 users."
    ]
  },
  {
    "company": "Manhattan Youth",
    "role": "After school CS Teacher",
    "tenure": "04/2021 – 12/2021",
    "accomplishments": [
      "Introduced students to JavaScript and its related technologies, such as React, Node.js, MongoDB, and PostgreSQL.",
      "Developed engaging lesson plans and projects to help students build a strong foundation in coding fundamentals.",
      "Mentored and provided feedback to students to help them succeed in their programming goals.",
      "Encouraged and facilitated student collaboration on projects to promote teamwork and peer learning.",
      "Stayed up to date with the latest trends and incorporated them into the curriculum as appropriate."
    ]
  },
  {
    "company": "Heidi Latsky Dance ",
    "role": "Full Stack Developer Intern",
    "tenure": "07/2020 – 04/2021",
    "accomplishments": [
      "Rebuilt the dance studio's website from scratch, utilizing React and Next.js to create a dynamic and interactive user experience.",
      "Incorporated Bootstrap to ensure consistency and maintainability in the styling of the website.",
      "Developed a custom content management system (CMS) using Node.JS, Express.js, and MongoDB, and React to make it easier for the dance studio to manage their content.",
      "Implemented Redux for state management and ensured data consistency throughout the application."
    ]
  }
]
